<template>
	<view>
		1、注册页面的推荐人
		2、官方客服的展示问题
		3、立即申请页面填写内容以后返回时页面显示什么
		4、新闻详情页的内容被简化了
		
		1、我的-个人资料-选择地区
		2、申请-信用卡申请-预约-选择时间
		3、服务 -申请查询 -日期
		4、会员调导航背景色
		5、产品分类获取高度
		6、分享记录获取高度
		7、服务-电话服务
		
		用户端：
		1、首页请求是否应该带登录信息的请求参数？不然怎么判断用户，获得用户名和头像呢？
		3、用户注册页面有没有推荐人字段，（原型图无推荐人，但是设计图有，待产品确认需求）
		4、发送验证码输入手机号都返回‘成功发送验证码’，但是手机并没有接收到验证码
		5、投诉页面的投诉理由分类由后端设置--前端获取，还是前端写死，需要确定投诉理由分类
		6、产品列表，更改了利息与额度的字段值，返回的产品列表排序看不出规律，不知道是否正确
		7、产品详情的评论、产品列表的产品是否可以增加一个'total'字段，告诉我一共有几条评论、几个产品，用于判断加载数据
		8、产品详情评论，一个用户只能增加一条评论？目前我增加的评论数据会覆盖前一条评论数据。同时获取的id=3的产品评论数为5，但列表只有一条
		9、缺少我的页面所有的用户信息获取接口(手机号、地区、性别、昵称)
		10、缺少提交保存实名认证的接口
		12、缺少查询页面的接口
		13、分类列表缺少产品图片
		14、申请上面服务接口，type字段只有信用卡和产品，缺少贷款申请
		15、缺少分享接口
		16、缺少升级会员接口
		17、缺少申请查询接口
		18、缺少自助服务的banner和通知接口获取申请填写资料类型列表
		19、在线申请的接口确实没太看懂，获取申请填写资料项接口许多不符实况，获取申请填写资料类型列表、提交资料没看懂
		
		
		用户端2：
		1、待确定 -- 获取实名认证状态接口文档:审核状态status，0-未认证，1-已认证，2-认证失败,实际返回: status:1,message:待审核。现在的问题：status状态对不上，是否需要增添状态？
		2、缺少--自助服务页面获取官方电话客服接口
		3、缺少--获取分享页面数据接口缺少性别字段
		4、待确定 -- 修改用户手机号提交成功，再次登录使用修改的手机号并不能提交，获取用户手机号也任然是之前的
		5、待确定 -- 忘记密码接口，有参数（code: "9257"，mobile: "18381007234"，password: "111111"）返回“用户未登录”？忘记密码应该不用登录的
		6、缺少 -- 缺少分享记录页面接口（自助服务--分享--记录）
		7、待确定 -- 官方客服怎么搞？接入第三方吗？
		8、待确定 -- /product/getInfo 接口除了input框，单选框，多选框只外有没有其它格式？需完全确定

		
		产品：
		1、有购买会员的接口但是无购买接口的页面,直接点击购买吗？
		2、头像有上传的地方吗？直接点击上传吗？
		3、申请查询查询及其消息
		
		1、产品详情--下拉加载评论
		2、产品列表--下拉加载
		3、预约上门的时间要更改到时分
		4、产品列表的最近查看、选择地区
		5、实名认证的身份证验证规则有问题
		
		待解决：
		1、预约上门办理的时间需要精确到时分
		2、处理在线申请填写资料时保存成功后的查看问题 v
		3、官方客服
		4、服务 -> 申请查询 -> 消息

		
		用户端3：
		1、待确定 -- 提交资料接口必需要传字段“spuId”--产品id，但是由：服务 - 申请贷款 / 申请信用卡 -点击进入的情况下，没有办法获得产品id呢？这里怎么处理呢？
		2、缺少 -- 服务 -> 申请查询页面接口缺少
		3、待确定 -- 服务页面的banner图和通知公告就是渠道商的接口 ‘http://47.108.91.77/treasure/m/merchant/product/main’对吗？
		4、待确定 -- 立即申请 -> 在线申请-> 填写资料页面，确认匹配进入产品匹配的逻辑是怎样的？产品列表页面有什么区别，得一起和产品确定一下
		5、待确定 -- 上传接口似乎有问题，访问接口“应用程序异常”：http://47.108.91.77/treasure/m/upload
		6、待确定 -- 产品列表的多个筛选项，再选择其它选项时，是筛选项叠加还是，还是将筛选项还原呢？似乎我多个条件一起筛选时数据不太对
		7、待确定 -- 免费版融云只能实时在线聊天，不能获取历史信息以及读取为未接收信息，得升级为商用版才可以
		8、待确定 -- 官方客服的融云id是什么？需要确定，目前只能获取用户的融云id
<!-- 		2、缺少 -- 立即申请 -> 在线申请-> 填写资料，缺少确认匹配的的接口。或许是我没有找到？ -->

		产品：
		1、立即申请 -> 在线申请-> 填写资料页面，确认匹配进入产品匹配的逻辑是怎样的
		2、产品列表的多个筛选项，再选择其它选项时，是筛选项叠加还是，还是将筛选项还原呢？
		3、图片往哪里上传呢？需要提供相关资料
		
		1、产品匹配 -> 立即申请，怎么跳转
		2、信用卡/贷款申请 的提示文案
		
		
		1.已知 -- 将提示文案更改为‘请输入手机号’
		2.已知 -- 注册成功以后自动跳转登陆页面
		3.和后端一起协商处理
		4.产品列表利息，额度的排序功能立马纠正，最近查看功能我理解为：记录当前页面查看的产品，退出列表页面清空。若是理解有误请告诉我详细的逻辑，原型图无标注
		5.
		6.已知 -- 在线客服发送消息先新增上，如果账户有升级增添信息查看功能
	</view>
</template>

<script>
	export default {
		data() {
			return {
				
			}
		},
		methods: {
			
		}
	}
</script>

<style>

</style>
