<template>
	<view>
		1、注册页面的推荐人
		2、官方客服的展示问题
		3、立即申请页面填写内容以后返回时页面显示什么
		4、新闻详情页的内容被简化了
		
		1、我的-个人资料-选择地区
		2、申请-信用卡申请-预约-选择时间
		3、服务 -申请查询 -日期
		4、会员调导航背景色
		5、产品分类获取高度
		6、分享记录获取高度
		7、服务-电话服务
		
		用户端：
		1、首页请求是否应该带登录信息的请求参数？不然怎么判断用户，获得用户名和头像呢？
		2、缺少搜索页面的接口
		3、注册页面缺少字段：‘密码’、‘推荐人’（原型图无推荐人，但是设计图有，待产品确认需求）
		4、发送验证码接口手机号输入随意字符都返回‘成功发送验证码’，但是手机并没有接收到验证码，手机号码这边需要我进行验证吗？（全是中国号码）
		5、投诉页面的投诉理由分类由后端设置--前端获取，还是前端写死，需要确定投诉理由分类
		6、产品列表，更改了利息与额度的字段值，返回的产品列表排序并不正确
		7、产品详情的评论、产品列表的产品是否可以增加一个'total'字段，告诉我一共有几条评论、几个产品，用于判断加载数据
		
		1、产品详情--下拉加载评论
		2、产品列表--下拉加载
		3、写评论做登录提示
		4、产品列表的最近查看
	</view>
</template>

<script>
	export default {
		data() {
			return {
				
			}
		},
		methods: {
			
		}
	}
</script>

<style>

</style>
