<template>
	<view>
		1、注册页面的推荐人
		2、官方客服的展示问题
		3、立即申请页面填写内容以后返回时页面显示什么
		4、新闻详情页的内容被简化了
		
		1、我的-个人资料-选择地区
		2、申请-信用卡申请-预约-选择时间
		3、服务 -申请查询 -日期
		4、会员调导航背景色
		5、产品分类获取高度
		6、分享记录获取高度
		7、服务-电话服务
		
		用户端：
		1、首页请求是否应该带登录信息的请求参数？不然怎么判断用户，获得用户名和头像呢？
		2、缺少搜索页面热门搜索的接口
		3、用户注册页面有没有推荐人字段，（原型图无推荐人，但是设计图有，待产品确认需求）
		4、发送验证码输入手机号都返回‘成功发送验证码’，但是手机并没有接收到验证码
		5、投诉页面的投诉理由分类由后端设置--前端获取，还是前端写死，需要确定投诉理由分类
		6、产品列表，更改了利息与额度的字段值，返回的产品列表排序看不出规律，不知道是否正确
		7、产品详情的评论、产品列表的产品是否可以增加一个'total'字段，告诉我一共有几条评论、几个产品，用于判断加载数据
		8、产品详情评论，一个用户只能增加一条评论？目前我增加的评论数据会覆盖前一条评论数据。同时获取的id=3的产品评论数为5，但列表只有一条
		9、缺少我的页面所有的用户信息获取接口(手机号、地区、性别、昵称)
		10、缺少提交保存实名认证的接口
		11、缺少帮助页面接口
		12、缺少查询页面的接口
		13、分类列表缺少产品图片
		14、申请上面服务接口，type字段只有信用卡和产品，缺少贷款申请
		15、缺少分享接口
		16、缺少升级会员接口
		17、缺少申请查询接口
		18、缺少自助服务的banner和通知接口获取申请填写资料类型列表
		19、在线申请的接口确实没太看懂，获取申请填写资料项接口许多不符实况，获取申请填写资料类型列表、提交资料没看懂
		
		产品：
		1、有上传头像的地方吗？
		2、官方客服怎么搞？
		
		
		
		10、新闻页面暂时无数据，可否增添一些测试数据
		11、没有在线客服接口
		
		1、产品详情--下拉加载评论
		2、产品列表--下拉加载
		3、预约上门的时间要更改到时分
		4、产品列表的最近查看、选择地区
		
	</view>
</template>

<script>
	export default {
		data() {
			return {
				
			}
		},
		methods: {
			
		}
	}
</script>

<style>

</style>
